Revit 2024 API
WorksharingDisplaySettings.GetGraphicOverrides Method
Overload List
Name | Description
GetGraphicOverrides(String)
 Returns the graphic overrides assigned for elements owned by a particular user.
GetGraphicOverrides(CheckoutStatus)
 Returns the graphic overrides associated with a particular ownership status.
GetGraphicOverrides(ModelUpdatesStatus)
 Returns the graphic overrides assigned to a particular model update status.
GetGraphicOverrides(WorksetId)
 Returns the graphic overrides assigned to elements in a particular workset.
See Also
WorksharingDisplaySettings Class
WorksharingDisplaySettings Members
Autodesk.Revit.DB Namespace